# ViewSolarstudyLightingAltitudeText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyLightingAltitudeText Property
ParameterTypeId Class See Also
---
"Lighting altitude text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyLightingAltitudeText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyLightingAltitudeText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyLightingAltitudeText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace